<a href="https://colab.research.google.com/github/FazilMSD7/Data-Analytics/blob/main/Pandas/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

###**Why Pandas?**
Python library, built on NumPy to work with data's
*  Import datasets(csv,excel,sql,json..)
*  Data cleaning : Missing and Invalid values(age - 200)
*  Size mutability : Easily delete rowns and cols
*  Reshaping and Pivoting of datasets
*  Efficient manipulation and extraction
*  Statistical analysis

###**Data Structures in Pandas**
Data structure are collection of data types that provide best way of organizing item in terms of memory.
* **Series** : <br>
1 dimensional DS, Only one col. and many row.<br>
Only one datatype(int/string) -> Homogeneous <br>
Size immutable (can't delete/add any row, It will create a new instead of updating older)

* Dataframes : <br>
2 dimensional DS<, Many rows and colsbr>
Multiple data types -> Hetrogenous<br>
Size mutable

In [1]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.12/dist-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in /usr/local/lib/python3.12/dist-packages (from pandas) (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.12/dist-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.12/dist-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.12/dist-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.12/dist-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

In [4]:
s = pd.Series([10,20,30,40])
s

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
s.values

array([10, 20, 30, 40])

In [7]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
s.name = 'numbers'
s

0    10
1    20
2    30
3    40
Name: numbers, dtype: int64

In [9]:
# Indexing
s[0:3]

0    10
1    20
2    30
Name: numbers, dtype: int64

In [12]:
# iloc -> location based indexing
s.iloc[3]

print(s.iloc[[1,2,3]])

1    20
2    30
3    40
Name: numbers, dtype: int64

In [17]:
s.name = 'Calories'
index = ['Apple','Banana','Strawberry','Mango']
s.index = index

s

Apple         10
Banana        20
Strawberry    30
Mango         40
Name: Calories, dtype: int64

In [18]:
s['Mango']

np.int64(40)

In [20]:
# loc -> label based indexing -> both start and stop are included
s.loc['Banana']

np.int64(20)

In [21]:
s.loc['Apple':'Strawberry']

Apple         10
Banana        20
Strawberry    30
Name: Calories, dtype: int64

In [26]:
# Series in Dict

d = {'Apple':0.3,'Kiwi':1.1,'Guava':2.6,'Avacado':2.0,'Banana':1.1}
s2 = pd.Series(d)
s2.name = 'Protein'
s2

Apple      0.3
Kiwi       1.1
Guava      2.6
Avacado    2.0
Banana     1.1
Name: Protein, dtype: float64